#### 데이터 분석을 위한 PANDAS_01

In [1]:
import pandas as pd

In [2]:
# k:v 구조를 갖는 딕셔너리를 만들고, 변수 dict_data에 저장
dict_data = {'a': 1, 'b': 2, 'c': 3}

In [3]:
# k:v 구조를 갖는 딕셔너리를 만들고, 변수 dict_data에 저장
sr = pd.Series(dict_data)

In [4]:
# 변수 sr의 자료형 출력
print(type(sr))

<class 'pandas.core.series.Series'>

In [5]:
# 변수 sr에 저장되어 있는 시리즈 객체를 출력
print(sr)

a    1
b    2
c    3
dtype: int64

In [8]:
# 리스트를 시리즈로 변환하여 변수 sr에 저장
list_data = ['2019-01-02', 3.14, 'ABC', 100, True]
sr=pd.Series(list_data)
print(sr,type(sr))

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object <class 'pandas.core.series.Series'>

In [9]:
# 인덱스 배열은 변수 idx에 저장. 데이터 값 배열은 변수 val에 저장
idx= sr.index
val=sr.values

In [10]:
print(idx)
print(val)

RangeIndex(start=0, stop=5, step=1)
['2019-01-02' 3.14 'ABC' 100 True]

In [11]:
# 튜플을 시리즈로 변환(index 옵션에 인덱스 이름을 지정)

tup_data = ('영인', '2010-05-01', '여', True)

In [12]:
sr=pd.Series(tup_data,index=['이름','생년월일','성별','학생여부'])

In [13]:
print(sr)

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [15]:
# 원소 1개를 선택
print(sr[0]) # sr의 1 번째 원소 선택 (정수형 위치 인덱스를 활용)

영인

C:\Users\KDP-27\AppData\Local\Temp\ipykernel_13468\226098797.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[0])

In [17]:
# '이름' 라벨을 가진 원소 선택 (인덱스 이름을 활용)
sr['이름']

'영인'

In [18]:
# 여러 개의 원소를 선택 (인덱스 리스트 활용)
print(sr[[1,2]])

생년월일    2010-05-01
성별               여
dtype: object

C:\Users\KDP-27\AppData\Local\Temp\ipykernel_13468\386896831.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[[1,2]])

In [19]:
print(sr[['생년월일','성별']])

생년월일    2010-05-01
성별               여
dtype: object

In [20]:
# 여러 개의 원소를 선택 (인덱스 범위 지정)

In [21]:
print(sr[1:2])

생년월일    2010-05-01
dtype: object

In [23]:
sr['생년월일':'성별']

생년월일    2010-05-01
성별               여
dtype: object

In [25]:
# 열이름을 key, 리스트를 value로 갖는 딕셔너리 정의(2차원 배열)
dict_data

{'a': 1, 'b': 2, 'c': 3}

In [26]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

In [28]:
# 판다스 DataFame() 함수로 딕셔너리를 데이터프레임으로 변환
df=pd.DataFrame(dict_data)

In [29]:
type(df)

pandas.core.frame.DataFrame

In [32]:
# 행 인덱스/열 이름을 지정하여, 데이터프레임 만들기
df=pd.DataFrame([[15,'남','덕영중'],[17,'여','수리중']],index=['준서','예은'],columns=['나이','성별','학교'])

In [33]:
# 행 인덱스, 열 이름 확인하기
print(df)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [35]:
#데이터프레임
df.index #행인덱스

Index(['준서', '예은'], dtype='object')

In [37]:
df.columns # 열 이름

Index(['나이', '성별', '학교'], dtype='object')

In [38]:
# 행 인덱스, 열 이름 변경하기
df.index=['학생1','학생2']
df.columns=['연령','남녀','소속']

In [39]:
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [40]:
df.index

Index(['학생1', '학생2'], dtype='object')

In [41]:
df.columns

Index(['연령', '남녀', '소속'], dtype='object')

In [42]:
# 열 이름 중, '나이'를 '연령','성별'을 '남녀','학교'를 소속으로
df2=df.rename(columns={'나이':'연령', '성별':'남녀', '학교':'소속'})

In [43]:
# df의 행 인덱스 중에서, '준서'를 '학생1', '예은'을 '학생2'로 바꾸기
df3=df.rename(index={'준서':'학생1', '예은':'학생2' }, inplace=True)

In [44]:
df2

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [48]:
df3

In [49]:
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [51]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름' : [ '서준', '우현', '인아'],
'수학' : [ 90, 80, 70],
'영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100],
'체육' : [ 100, 90, 90]}

In [52]:
df=pd.DataFrame(exam_data)

In [53]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [54]:
type(df)

pandas.core.frame.DataFrame

In [56]:
# '수학' 점수 데이터만 선택. 변수 math1에 저장
math1=df['수학']

In [57]:
math1

0    90
1    80
2    70
Name: 수학, dtype: int64

In [58]:
type(math1)

pandas.core.series.Series

In [59]:
# '영어' 점수 데이터만 선택. 변수 english에 저장
english=df.영어

In [60]:
english

0    98
1    89
2    95
Name: 영어, dtype: int64

In [61]:
# '음악', '체육' 점수 데이터를 선택. 변수 music_gym 에 저장
music_gym=df[['음악','체육']]

In [62]:
music_gym

    음악   체육
0   85  100
1   95   90
2  100   90

In [63]:
type(music_gym)

pandas.core.frame.DataFrame

In [64]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름' : [ '서준', '우현', '인아'],
'수학' : [ 90, 80, 70],
'영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100],
'체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)

In [65]:
# '이름' 열을 새로운 인덱스로 지정하고, df 객체에 변경사항 반영
df.set_index('이름',inplace=True)

In [66]:
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [67]:
# 데이터프레임 df의 특정 원소 1개 선택 ('서준'의 '음악' 점수)
a=df.loc['서준','음악']
a

85

In [68]:
b=df.iloc[0,2]

In [69]:
# 데이터프레임 df의 특정 원소 2개 이상 선택 ('서준'의 '음악', '체육' 점수)
c=df.loc['서준',['음악','체육']]

In [70]:
c

음악     85
체육    100
Name: 서준, dtype: int64

In [71]:
d=df.iloc[0,[2,3]]

In [72]:
d

음악     85
체육    100
Name: 서준, dtype: int64

In [73]:
e=df.loc['서준','음악':'체육']
e

음악     85
체육    100
Name: 서준, dtype: int64

In [75]:
f=df.iloc[0,2:]
f

음악     85
체육    100
Name: 서준, dtype: int64

In [78]:
# df의 2개 이상의 행과 열로부터 원소 선택 ('서준', '우현'의 '음악', '체육' 점수)
g=df.loc[['서준','우현'],['음악','체육']]

In [80]:
g

    음악   체육
이름
서준  85  100
우현  95   90

In [81]:
h=df.iloc[[0,1],[2,3]]
h

    음악   체육
이름
서준  85  100
우현  95   90

In [83]:
i=df.loc['서준':'우현','음악':'체육']
i

    음악   체육
이름
서준  85  100
우현  95   90

In [88]:
j=df.iloc[:2,2:]
j

    음악   체육
이름
서준  85  100
우현  95   90

In [89]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름' : [ '서준', '우현', '인아'],
'수학' : [ 90, 80, 70],
'영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100],
'체육' : [ 100, 90, 90]}

In [91]:
df=pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [92]:
# 데이터프레임 df에 '국어' 점수 열(column)을 추가. 데이터 값은 80 지정
df['국어']=80
df

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80

In [93]:
# 새로운 행(row)을 추가 - 같은 원소 값을 입력
df.loc[3]=0
df

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80
3   0   0   0    0    0   0

In [94]:
# 새로운 행(row)을 추가 - 원소 값 여러 개의 배열 입력
df.loc[4]=['동규',90,80,70,60,80]
df

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80
3   0   0   0    0    0   0
4  동규  90  80   70   60  80

In [95]:
# 새로운 행(row)을 추가 - 기존 행을 복사
df.loc['행5']=df.loc[3]
df

    이름  수학  영어   음악   체육  국어
0   서준  90  98   85  100  80
1   우현  80  89   95   90  80
2   인아  70  95  100   90  80
3    0   0   0    0    0   0
4   동규  90  80   70   60  80
행5   0   0   0    0    0   0

In [96]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름' : [ '서준', '우현', '인아'],
'수학' : [ 90, 80, 70],
'영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100],
'체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)

In [97]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [98]:
# '이름' 열을 새로운 인덱스로 지정하고, df 객체에 변경사항 반영
df.set_index('이름',inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [99]:
# 데이터프레임 df의 특정 원소를 변경하는 방법: '서준'의 '체육' 점수
df.iloc[0,3]=80
df

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

In [100]:
df.loc['서준']['체육']=90
df

C:\Users\KDP-27\AppData\Local\Temp\ipykernel_13468\3434448550.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.loc['서준']['체육']=90

    수학  영어   음악  체육
이름
서준  90  98   85  90
우현  80  89   95  90
인아  70  95  100  90

In [102]:
df.iloc[0][3]=80
df

C:\Users\KDP-27\AppData\Local\Temp\ipykernel_13468\503377599.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.iloc[0][3]=80
C:\Users\KDP-27\AppData\Local\Temp\ipykernel_13468\503377599.py:1: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  df.iloc[0][3]=80

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

In [103]:
df.loc['서준', '체육'] = 100

In [104]:
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [105]:
# 데이터프레임 df의 원소 여러 개를 변경하는 방법: '서준'의 '음악', '체육' 점수
df.loc['서준',['음악','체육']]=50
df

    수학  영어   음악  체육
이름
서준  90  98   50  50
우현  80  89   95  90
인아  70  95  100  90

In [106]:
df.loc['서준',['음악','체육']]=100,50
df

    수학  영어   음악  체육
이름
서준  90  98  100  50
우현  80  89   95  90
인아  70  95  100  90